<h1 style='color:Green'>Pandas</h1>

In [5]:
import numpy as np

In [7]:
import pandas as pd

### Series

In [9]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [11]:
d

{'a': 10, 'b': 20, 'c': 30}

### Series with python list

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

### Series with numpy array

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [9]:
 ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [10]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,3,4],['Germany','Italy','Japan','USA'])

In [12]:
ser2

Germany    1
Italy      2
Japan      3
USA        4
dtype: int64

In [13]:
ser2['Germany']

1

In [14]:
ser2['Japan']

3

In [15]:
ser1 + ser2

Germany    3.0
Italy      NaN
Japan      7.0
USA        5.0
USSR       NaN
dtype: float64

### DataFrames

In [4]:
import numpy as np 
import pandas as pd

In [6]:
from numpy.random import randn

#### The line np.random.seed(101) is used in Python with the NumPy library to set the random seed, which ensures reproducibility of random numbers.

In [8]:
np.random.seed(101)

In [11]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Column

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [23]:
df['new'] = df['W'] + df['Y']

In [25]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df.drop('new', axis=1, inplace=True)

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### DF Row

In [51]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [56]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [58]:
df.loc['B', 'Y']

-0.8480769834036315

In [60]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [68]:
import numpy as np 
import pandas as pd

In [29]:
from numpy.random import randn

In [72]:
np.random.seed(101)

In [75]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [77]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
booldf = df>0

In [84]:
 booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [88]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [86]:
#Shortcut 
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [102]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [104]:
resultdf = df[df['W']>0]

In [106]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [108]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [110]:
#Shortcut 
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [114]:
df[df['W']>0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [118]:
# and = & , or = |

In [120]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [122]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [126]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [150]:
df.reset_index() #for permanent change, set implace=True

  index         W         X         Y         Z divisions
0     A  2.706850  0.628133  0.907969  0.503826       Dha
1     B  0.651118 -0.319318 -0.848077  0.605965       Ctg
2     C -2.018168  0.740122  0.528813 -0.589001       Bar
3     D  0.188695 -0.758872 -0.933237  0.955057       Raj
4     E  0.190794  1.978757  2.605967  0.683509       Mym

In [130]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### split function

In [137]:
newid = 'Dha Ctg Bar Raj Mym'.split()

In [139]:
newid

['Dha', 'Ctg', 'Bar', 'Raj', 'Mym']

In [141]:
df['divisions'] = newid

In [143]:
df

          W         X         Y         Z divisions
A  2.706850  0.628133  0.907969  0.503826       Dha
B  0.651118 -0.319318 -0.848077  0.605965       Ctg
C -2.018168  0.740122  0.528813 -0.589001       Bar
D  0.188695 -0.758872 -0.933237  0.955057       Raj
E  0.190794  1.978757  2.605967  0.683509       Mym

In [148]:
df.set_index('divisions') #for permanent change, set implace=True

                  W         X         Y         Z
divisions
Dha        2.706850  0.628133  0.907969  0.503826
Ctg        0.651118 -0.319318 -0.848077  0.605965
Bar       -2.018168  0.740122  0.528813 -0.589001
Raj        0.188695 -0.758872 -0.933237  0.955057
Mym        0.190794  1.978757  2.605967  0.683509

In [21]:
import numpy as np 
import pandas as pd

In [58]:
#Index Levels 
outside = ['Fruit', 'Fruit', 'Fruit', 'Drink', 'Drink'] 
inside = ['Apple','Mango','Banana', 'Drinku', 'Funta'] 
hier_index = list(zip(outside,inside)) 
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [62]:
df = pd.DataFrame(randn(5,2), hier_index, ['Green', 'Yellow'])

In [64]:
df

                 Green    Yellow
Fruit Apple   0.039977 -0.018029
      Mango  -0.566637 -0.812353
      Banana -0.665289 -1.078124
Drink Drinku  2.399991  1.820294
      Funta  -0.238214  0.022202

In [66]:
#Index Levels 
outside = ['G1', 'G1','G2', 'G2', 'G2', 'G2'] 
inside = [1,2,1,2,3,4] 
hier_index = list(zip(outside,inside)) 
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [68]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [70]:
df

             A         B
G1 1 -0.777645  0.293197
   2 -1.120736 -0.843018
G2 1 -0.492615  1.109303
   2 -0.112871 -0.379877
   3  0.422918 -1.887086
   4  1.623972  1.262262

In [72]:
df.loc['G1']

          A         B
1 -0.777645  0.293197
2 -1.120736 -0.843018

In [74]:
df.loc['G1'].loc[2]

A   -1.120736
B   -0.843018
Name: 2, dtype: float64

In [76]:
df

             A         B
G1 1 -0.777645  0.293197
   2 -1.120736 -0.843018
G2 1 -0.492615  1.109303
   2 -0.112871 -0.379877
   3  0.422918 -1.887086
   4  1.623972  1.262262

In [78]:
df.index.names = ['Groups', 'Num']

In [80]:
df

                   A         B
Groups Num
G1     1   -0.777645  0.293197
       2   -1.120736 -0.843018
G2     1   -0.492615  1.109303
       2   -0.112871 -0.379877
       3    0.422918 -1.887086
       4    1.623972  1.262262

In [82]:
df.loc['G2'].loc[2]['B']

-0.37987650125315314

In [84]:
df.loc['G1']

            A         B
Num
1   -0.777645  0.293197
2   -1.120736 -0.843018

##### The expression df.xs('G1') is used in pandas to select data from a DataFrame using a cross-section (xs)  typically when you're working with a MultiIndex DataFrame.

In [91]:
df.xs('G1')

            A         B
Num
1   -0.777645  0.293197
2   -1.120736 -0.843018

In [95]:
df

                   A         B
Groups Num
G1     1   -0.777645  0.293197
       2   -1.120736 -0.843018
G2     1   -0.492615  1.109303
       2   -0.112871 -0.379877
       3    0.422918 -1.887086
       4    1.623972  1.262262

In [99]:
df.xs(1, level='Num')

               A         B
Groups
G1     -0.777645  0.293197
G2     -0.492615  1.109303

In [101]:
df.xs(2, level='Num')

               A         B
Groups
G1     -1.120736 -0.843018
G2     -0.112871 -0.379877

### Missing Values

In [106]:
import numpy as np 
import pandas as pd

In [108]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [110]:
df = pd.DataFrame(d)

In [112]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [114]:
df.dropna() #Remove row having Nan value

     A    B  C
0  1.0  5.0  1

In [116]:
df.dropna(axis=1) #Remove col having Nan value

   C
0  1
1  2
2  3

In [118]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [120]:
df.dropna(thresh=2)  # Keep only those rows that have at least 2 non-null values.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [122]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [124]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [126]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [128]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [131]:
import numpy as np 
import pandas as pd

In [133]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'], 
        'PERSON' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales'  : [200, 120, 340, 124, 243, 350]
       }

In [137]:
df = pd.DataFrame(data)

In [139]:
df

  Company   PERSON  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [141]:
byComp = df.groupby('Company')

In [145]:
byComp.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [147]:
byComp.sum(numeric_only=True)

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [159]:
byComp.std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [157]:
byComp.sum(numeric_only=True).loc['FB']

Sales    593
Name: FB, dtype: int64

In [153]:
#Shortcut 
df.groupby('Company').sum(numeric_only=True).loc['FB']

Sales    593
Name: FB, dtype: int64

In [266]:
df.groupby('Company').count()

         PERSON  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [268]:
df.groupby('Company').max()

          PERSON  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [272]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [283]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [285]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Merging, Joining, and Concatenating

In [293]:
import pandas as pd

In [297]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
                    'B': ['B0','B1','B2','B3'], 
                    'C': ['C0','C1','C2','C3'], 
                    'D': ['D0','D1','D2','D3']}, 
                    index = [0, 1, 2, 3])

In [299]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
                    'B': ['B4','B5','B6','B7'], 
                    'C': ['C4','C5','C6','C7'], 
                    'D': ['D4','D5','D6','D7']}, 
                    index = [4, 5, 6, 7])

In [301]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
                    'B': ['B8','B9','B10','B11'], 
                    'C': ['C8','C9','C10','C11'], 
                    'D': ['D8','D9','D10','D11']}, 
                    index = [8, 9, 10, 11])

In [304]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [306]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [308]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation  
#### Concatenation basically glues togather DataFrames. Keep in mind that dimensions should match along the axis you are concatenation on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [315]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [318]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [335]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 
                     'A'  : ['A0', 'A1', 'A2', 'A3'], 
                     'B'  : ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 
                      'C'  : ['C0', 'C1', 'C2', 'C3'],
                      'D'  : ['D0', 'D1', 'D2', 'D3']})

In [337]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [339]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

#### The Merge function allows you to marge DataFrames together using a similar logic as merging SQL Tables together.

In [341]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [343]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K3'], 
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A'  : ['A0', 'A1', 'A2', 'A3'], 
                     'B'  : ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C'  : ['C0', 'C1', 'C2', 'C3'],
                      'D'  : ['D0', 'D1', 'D2', 'D3']})

In [345]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [347]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K3   K1   A3   B3  NaN  NaN

In [349]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

## Joining

#### Joining is a convenient method for combining the columns of two potentially differentlty-indexed DataFrames into a single result Dataframe

In [372]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 
                     'B': ['B0', 'B1', 'B3']},
                      index = ['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'], 
                      'D': ['D0', 'D2', 'D3']}, 
                       index = ['K0', 'K1', 'K2'])

In [374]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C2  D2
K2  A2  B3  C3  D3

In [376]:
left.join(right, how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C2  D2
K2  A2  B3  C3  D3

## Pandas - Operations

In [4]:
import numpy as np 
import pandas as pd

In [6]:
df = pd.DataFrame({'col1':[1,2,3,4], 
                   'col2':[444,555,666,444], 
                   'col3':['abc','def','ghi','xyz']})

In [8]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [14]:
len(df['col2'].unique())

3

In [16]:
df['col2'].nunique()

3

In [22]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [19]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [26]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [30]:
def times2(x): 
    return x*2

In [34]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [32]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [37]:
#Shortcut 
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [40]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [42]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [45]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [52]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [54]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [60]:
data = {'A': ['foo','foo', 'foo', 'bar', 'bar', 'bar'], 
        'B': ['one', 'one', 'two', 'two', 'one', 'one'], 
        'C': ['x','y','x','y','x','y'],
        'D': [1, 3, 2, 5, 4, 1]
       }

In [64]:
df = pd.DataFrame(data)

In [67]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [69]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output

#### CSV, Excel, HTML, SQL

In [80]:
!conda install -y sqlalchemy lxml html5lib beautifulsoup4

Channels:
 - defaults
Platform: win-64
Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\user\anaconda3

  added / updated specs:
    - beautifulsoup4
    - html5lib
    - lxml
    - sqlalchemy


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2025.2.25  |       haa95532_0         130 KB
    certifi-2025.1.31          |  py312haa95532_0         164 KB
    conda-24.11.3              |  py312haa95532_0         1.2 MB
    cpp-expected-1.1.0         |       h214f63a_0         131 KB
    html5lib-1.1               |     pyhd3eb1b0_0          91 KB
    libarchive-3.7.7           |       h9243413_0         1.8 MB
    libmamba-2.0.5             |       hcd6fe79_1         4.7 MB
    libmambapy-2.0.5           |  py312h214f63a_1         461 KB
    libsolv-0.7.30             |       hf2fb9eb_1         473 KB
    libxml2-2.13.5             |       h24da03e_0         2.9 MB
    libxslt-1.1.41             |       h0739af5_0         467 KB
    lxml-5.3.0                 |  py312h395c83e_1         1.1 MB
    nlohmann_json-3.11.2       |       h6c2663c_0         126 KB
    openssl-3.0.16             |       h3f729d1_0         7.8 MB
    simdjson-3.10.1            |       h214f63a_0         275 KB
    spdlog-1.11.0              |       h59b6b97_0         195 KB
    sqlalchemy-2.0.37          |  py312h54f65d0_0         6.5 MB
    ------------------------------------------------------------
                                           Total:        28.6 MB

The following NEW packages will be INSTALLED:

  cpp-expected       pkgs/main/win-64::cpp-expected-1.1.0-h214f63a_0
  html5lib           pkgs/main/noarch::html5lib-1.1-pyhd3eb1b0_0
  nlohmann_json      pkgs/main/win-64::nlohmann_json-3.11.2-h6c2663c_0
  simdjson           pkgs/main/win-64::simdjson-3.10.1-h214f63a_0
  spdlog             pkgs/main/win-64::spdlog-1.11.0-h59b6b97_0

The following packages will be UPDATED:

  ca-certificates                       2024.7.2-haa95532_0 --> 2025.2.25-haa95532_0
  certifi                         2024.8.30-py312haa95532_0 --> 2025.1.31-py312haa95532_0
  conda                              24.7.1-py312haa95532_0 --> 24.11.3-py312haa95532_0
  libarchive                               3.6.2-hb62f4d4_3 --> 3.7.7-h9243413_0
  libmamba                                 1.5.8-h99b1521_2 --> 2.0.5-hcd6fe79_1
  libmambapy                          1.5.8-py312h77c03ed_2 --> 2.0.5-py312h214f63a_1
  libsolv                                 0.7.24-h23ce68f_1 --> 0.7.30-hf2fb9eb_1
  libxml2                                 2.10.4-h0ad7f3c_2 --> 2.13.5-h24da03e_0
  libxslt                                 1.1.37-h2bbff1b_1 --> 1.1.41-h0739af5_0
  lxml                                5.2.1-py312h09808a7_0 --> 5.3.0-py312h395c83e_1
  openssl                                 3.0.15-h827c3e9_0 --> 3.0.16-h3f729d1_0
  sqlalchemy                         2.0.30-py312h827c3e9_0 --> 2.0.37-py312h54f65d0_0



Downloading and Extracting Packages: ...working... done
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

(base) D:\Cpppppp\ML\03-Python-for-Data-Analysis-Pandas>L "C:\Users\user\anaconda3\condabin\..\Scripts\conda.exe"   install -y sqlalchemy lxml html5lib beautifulsoup4

'L' is not recognized as an internal or external command,
operable program or batch file.

In [84]:
pwd

'D:\\Cpppppp\\ML\\03-Python-for-Data-Analysis-Pandas'

In [88]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [90]:
df = pd.read_csv('example')

In [92]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [98]:
df.to_csv('My_output', index=False)

In [100]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [112]:
!pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
   ---------------------------------------- 0.0/96.5 kB ? eta -:--:--
   ---------------------------------------- 0.0/96.5 kB ? eta -:--:--
   ---- ----------------------------------- 10.2/96.5 kB ? eta -:--:--
   ---------------- ----------------------- 41.0/96.5 kB 393.8 kB/s eta 0:00:01
   ---------------------------------------- 96.5/96.5 kB 690.3 kB/s eta 0:00:00
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [116]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [118]:
df.to_excel("Excel_Sample2.xlsx", sheet_name='NewSheet')

In [122]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [124]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
1,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
2,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
3,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
4,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544

In [130]:
from sqlalchemy import create_engine

In [132]:
engine = create_engine('sqlite:///:memory:')

In [134]:
df.to_sql('my_table', engine)

4

In [136]:
sqldf = pd.read_sql('my_table', con=engine)

In [138]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15